{"pageProps":{"errorCode":false,"pageData":{"title":"Política de Privacidade","slug":"politica-de-privacidade","description":"Política de Privacidade do Gerador de Tudo","content":"<p>\n      O <strong>Gerador de Tudo</strong>, reconhece que a privacidade é importante.\n    </p>\n    <p>\n      O <strong>Gerador de Tudo</strong> recebe e mantém informações de seu browser nos nossos servidores, incluindo seu IP ou endereço de referência e a página que você procurou. Além desta informação, a única outra informação pessoal que nós coletamos sobre você é a que nos for fornecida em nossos formulários online. O <strong>Gerador de Tudo</strong> será a única dententora desta informação. Esta informação somente será usada para nosso acompanhamento estatístico do número de visitas.\n    </p>\n    <p>\n      O <strong>Gerador de Tudo</strong> usa cookies e outras tecnologias para melhorar a sua experiência on-line e para saber como você usa nossos serviços, com a finalidade de melhorar a qualidade deles.\n    </p>\n    <p>\n      Usamos empresas de publicidade de terceiros para veicular anúncios durante a sua visita ao nosso website. Essas empresas podem usar informações (que não incluem o seu nome, endereço, endereço de e-mail ou número de telefone) sobre suas visitas a este e a outros websites a fim de exibir anúncios relacionados a produtos e serviços de seu interesse. Para obter mais informações sobre essa prática e saber como impedir que as empresas utilizem esses dados, clique aqui.\n    </p>\n    <h2>Anúncios Google:</h2>\n    <p>\n      O Google, como fornecedor de terceiros, utiliza cookies para exibir anúncios no seu site.\n    </p>\n    <p>\n      Com o cookie DART, o Google pode exibir anúncios para seus usuários com base nas visitas feitas aos seus e a outros sites na Internet.\n    </p>\n    <p>\n      Os usuários podem desativar o cookie DART visitando a Política de privacidade da rede de conteúdo e dos anúncios do Google.\n    </p>\n    <p>\n      Esta política pode ser atualizada sem aviso prévio, portanto revise-a periodicamente para assegurar-se de estar informado sobre estas mudanças.\n    </p>"}},"__N_SSG":true}